'''
Задача 1
В модуль с проверкой даты  добавьте возможность запуска в терминале с передачей даты на проверку. .
'''

from Homework.Seminar_6.module_task_1 import calend, calend_tetminal


if __name__ == '__main__':
    print(calend('30.12.2018'))
    calend_tetminal()
